In [9]:
pip install psycopg2

Requirement already satisfied: psycopg2 in c:\users\killk\anaconda3\lib\site-packages (2.8.4)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import psycopg2

ModuleNotFoundError: No module named 'psycopg2'

In [13]:
def aws():
    try:
        connection = psycopg2.connect(user='postgres',
                                      password='postgres',
                                      host='dbtest-1.cmwfjvlei66t.eu-central-1.rds.amazonaws.com',
                                      port='5432',
                                      database='postgres')
        cursor = connection.cursor()
        query = "Select * from exchanges"
        print('connected')
    except(Exception, psycopg2.Error) as error:
        print(error)

In [14]:
aws()

connected

In [3]:
import seaborn

In [4]:
import pandas as pd

In [5]:
df = pd.read_csv('titanic.csv')

In [6]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [10]:
auto = pd.read_csv('auto-mpg.csv', header = None, delim_whitespace = True)

In [11]:
auto.head()

      0  1      2      3       4     5   6  7                          8
0  18.0  8  307.0  130.0  3504.0  12.0  70  1  chevrolet chevelle malibu
1  15.0  8  350.0  165.0  3693.0  11.5  70  1          buick skylark 320
2  18.0  8  318.0  150.0  3436.0  11.0  70  1         plymouth satellite
3  16.0  8  304.0  150.0  3433.0  12.0  70  1              amc rebel sst
4  17.0  8  302.0  140.0  3449.0  10.5  70  1                ford torino

In [25]:
auto.columns = ['mpg','cylinders','displacement','horsepower',
               'weight', 'acceleration','model_year', 'origin', 'car_name']

In [26]:
auto.columns

Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'model_year', 'origin', 'car_name'],
      dtype='object')